@sdebruyn unfortunately when I run this: 

```hcl
resource "databricks_notebook" "spark_setup" {
  content   = base64encode(templatefile("${path.module}/spark_setup.scala", { blob_host = "testhost" }))
  language  = "SCALA"
  path      = "/Shared/spark_setup.scala"
  overwrite = false
  mkdirs    = true
  format    = "SOURCE"
}
```

I get a proper plan:

```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # databricks_notebook.spark_setup will be created
  + resource "databricks_notebook" "spark_setup" {
      + content     = "2290279572"
      + format      = "SOURCE"
      + id          = (known after apply)
      + language    = "SCALA"
      + mkdirs      = true
      + object_id   = (known after apply)
      + object_type = (known after apply)
      + overwrite   = false
      + path        = "/Shared/spark_setup.scala"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```

I am also able to apply appropriately as well.

The actual problem is the interpolation, when the statefunc is called during the plan phase for some reason and if there is an error it panics rather than return the "zero" value of the datatype. The easiest fix for this is to make the state function look like the following:

```go
"content": &schema.Schema{
				Type:     schema.TypeString,
				Required: true,
				ForceNew: true,
				StateFunc: func(i interface{}) string {
					base64String := i.(string)
					base64, err := convertBase64ToCheckSum(base64String)
					if err != nil {
						return ""
					}
					return base64
				},
			},
```

Please let me know if the above resolves this issue in your fork.

I would love to avoid having to store the base64 string in the statefile if that can be avoided by a crc checksum to determine state differences instead. Makes the state more scalable to larger workspaces. 